lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/examples/Zigbee/ZigbeeHaOnOffLightJoinable/ZigbeeHaOnOffLightJoinable.ino
  ZigbeePersistentState state{};
  const ZigbeePersistentLoadStatus loadStatus =
      g_store.loadWithStatus(&state);
  if (loadStatus == ZigbeePersistentLoadStatus::kLive &&
      state.ieeeAddress == kIeeeAddress) {
    g_restoredState = state;
    g_haveRestoredState = true;
    g_outgoingFrameCounters.restore(state);
    g_persistentSecurityReady = true;
    g_savedOnOffState = state.onOffState;
    ZigbeeCommissioning::restoreEndDeviceState(&g_network, state, kIeeeAddress);
  } else if (loadStatus == ZigbeePersistentLoadStatus::kEmpty ||
             loadStatus == ZigbeePersistentLoadStatus::kTombstone) {
    g_persistentSecurityReady = true;
  }
  if (g_persistentSecurityReady &&
      (g_securityEnabled || g_haveActiveNetworkKey) &&
      !g_outgoingFrameCounters.enabled(ZigbeeOutgoingCounterDomain::kNwk)) {
    g_persistentSecurityReady = false;
  }
  if (g_persistentSecurityReady && !g_joined && !g_rejoinPending) {
    ZigbeeCommissioning::requestNetworkSteering(&g_network);
  }

  configureDeviceForCurrentNetwork();
  applyLedState();
}

bool clearJoinState(bool clearStore) {
  refreshCommissioningState();
  ZigbeeCommissioning::clearEndDeviceState(&g_network, clearStore);
  if (clearStore) {
    g_outgoingFrameCounters.disable(ZigbeeOutgoingCounterDomain::kNwk);
    g_outgoingFrameCounters.disable(
        ZigbeeOutgoingCounterDomain::kApsTrustCenter);
  }
  clearPendingApsAck();
  clearRecentInboundAps();
  clearInboundNwkSecurityCounters();
  if (clearStore) {
    g_restoredState = ZigbeePersistentState{};
    g_haveRestoredState = false;
  }
  configureDeviceForCurrentNetwork();
  applyLedState();
  const bool persistenceOk = clearStore ? g_store.clear() : persistState();
  if (clearStore) {
    g_persistentSecurityReady = persistenceOk;
  }
  if (clearStore && persistenceOk && !g_radioReady) {
    g_radioReady = g_radio.begin(g_channel, 8);
  }
  return persistenceOk;
}

[[maybe_unused]] ZigbeeCommissioningStartRequest requestCommissioningStart() {
  refreshCommissioningState();
  return ZigbeeCommissioning::requestRejoinOrSteering(&g_network);
}

void handleAcceptedLeaveRequest(uint8_t leaveFlags) {
  const ZigbeeAcceptedLeaveDisposition disposition =
      ZigbeeCommissioning::applyAcceptedLeaveRequest(&g_network, leaveFlags);

  if (disposition == ZigbeeAcceptedLeaveDisposition::kClearState) {
    Serial.print("mgmt_leave accepted clear\r\n");
    clearJoinState(true);
    return;
  }

  clearPendingApsAck();
  clearRecentInboundAps();
  if (disposition == ZigbeeAcceptedLeaveDisposition::kPersistRejoin) {
    if (!persistState()) {
      Serial.print("mgmt_leave persistence failed\r\n");
      return;
    }
    Serial.print("mgmt_leave accepted rejoin\r\n");
    return;
  }

  Serial.print("mgmt_leave accepted rejoin_unavailable failure=");
  Serial.print(ZigbeeCommissioning::failureName(g_network.lastFailure));
  Serial.print("\r\n");
  clearJoinState(true);
}

void clearPendingApsAck() {
  for (PendingApsAck& pending : g_pendingApsAcks) {
    pending = PendingApsAck{};
  }
}

void clearPendingApsAckSlot(uint8_t slot) {
  if (slot >= kPendingApsAckSlots) {
    return;
  }
  g_pendingApsAcks[slot] = PendingApsAck{};
}

void clearRecentInboundAps() {
  g_recentInboundAps = RecentInboundAps{};
}

void clearInboundNwkSecurityCounters() {
  for (InboundNwkSecurityCounter& counter : g_inboundNwkSecurityCounters) {
    counter = InboundNwkSecurityCounter{};
  }
}

bool matchesPendingApsAck(const PendingApsAck& pending,
                          const ZigbeeApsAcknowledgementFrame& ack,
                          uint16_t sourceShort) {
  return pending.active && ack.valid && !ack.ackFormatCommand &&
         sourceShort == pending.destinationShort &&
         ack.counter == pending.counter &&
         ack.clusterId == pending.clusterId &&
         ack.profileId == pending.profileId &&
         ack.destinationEndpoint == pending.sourceEndpoint &&
         ack.sourceEndpoint == pending.destinationEndpoint;
}

bool findPendingApsAckSlot(const ZigbeeApsAcknowledgementFrame& ack,
                           uint16_t sourceShort, uint8_t* outSlot) {
  if (outSlot == nullptr) {
    return false;
  }

  for (uint8_t i = 0U; i < kPendingApsAckSlots; ++i) {
    if (matchesPendingApsAck(g_pendingApsAcks[i], ack, sourceShort)) {
      *outSlot = i;
      return true;
    }
  }
  return false;
}

void rememberPendingApsAck(uint16_t destinationShort,
                           const ZigbeeApsDataFrame& aps,
                           const uint8_t* payload, uint8_t payloadLength) {
  uint8_t slot = kPendingApsAckSlots;
  if (aps.deliveryMode != kZigbeeApsDeliveryUnicast || !aps.ackRequested ||
      payloadLength > sizeof(g_pendingApsAcks[0].payload) ||
      (payloadLength > 0U && payload == nullptr)) {
    return;
  }
  const uint32_t nowMs = millis();
  uint8_t oldestActiveSlot = 0U;
  bool haveOldestActiveSlot = false;
  for (uint8_t i = 0U; i < kPendingApsAckSlots; ++i) {
    PendingApsAck& pending = g_pendingApsAcks[i];
    if (pending.active &&
        pending.destinationShort == destinationShort &&
        pending.counter == aps.counter &&
        pending.clusterId == aps.clusterId &&
        pending.profileId == aps.profileId &&
        pending.destinationEndpoint == aps.destinationEndpoint &&
        pending.sourceEndpoint == aps.sourceEndpoint) {
      slot = i;
      break;
    }
    if (!pending.active ||
        static_cast<int32_t>(nowMs - pending.deadlineMs) >= 0) {
      slot = i;
      break;
    }
    if (!haveOldestActiveSlot ||
        static_cast<int32_t>(pending.deadlineMs -
                             g_pendingApsAcks[oldestActiveSlot].deadlineMs) < 0) {
      oldestActiveSlot = i;
      haveOldestActiveSlot = true;
    }
  }
  if (slot >= kPendingApsAckSlots) {
    slot = oldestActiveSlot;
  }

  PendingApsAck& pending = g_pendingApsAcks[slot];
  pending = PendingApsAck{};
  pending.active = true;
  pending.destinationShort = destinationShort;
  pending.counter = aps.counter;
  pending.clusterId = aps.clusterId;
  pending.profileId = aps.profileId;
  pending.destinationEndpoint = aps.destinationEndpoint;
  pending.sourceEndpoint = aps.sourceEndpoint;
  pending.retriesRemaining = kApsAckRetryLimit;
  pending.payloadLength = payloadLength;
  if (payloadLength > 0U) {
    memcpy(pending.payload, payload, payloadLength);
  }
  pending.deadlineMs = nowMs + kApsAckTimeoutMs;
}

void rememberRecentInboundAps(uint16_t sourceShort,
                              const ZigbeeApsDataFrame& aps) {
  g_recentInboundAps.valid = true;
  g_recentInboundAps.sourceShort = sourceShort;
  g_recentInboundAps.counter = aps.counter;
  g_recentInboundAps.clusterId = aps.clusterId;
  g_recentInboundAps.profileId = aps.profileId;
  g_recentInboundAps.destinationEndpoint = aps.destinationEndpoint;
  g_recentInboundAps.sourceEndpoint = aps.sourceEndpoint;
  g_recentInboundAps.deliveryMode = aps.deliveryMode;
  g_recentInboundAps.expiresMs = millis() + kRecentInboundApsWindowMs;
}

bool isRecentInboundApsDuplicate(uint16_t sourceShort,
                                 const ZigbeeApsDataFrame& aps,
                                 uint32_t nowMs) {
  if (!g_recentInboundAps.valid ||
      static_cast<int32_t>(nowMs - g_recentInboundAps.expiresMs) >= 0) {
    clearRecentInboundAps();
    return false;
  }
  return g_recentInboundAps.sourceShort == sourceShort &&
         g_recentInboundAps.counter == aps.counter &&
         g_recentInboundAps.clusterId == aps.clusterId &&
         g_recentInboundAps.profileId == aps.profileId &&
         g_recentInboundAps.destinationEndpoint == aps.destinationEndpoint &&
         g_recentInboundAps.sourceEndpoint == aps.sourceEndpoint &&
         g_recentInboundAps.deliveryMode == aps.deliveryMode;
}

bool isTrustedNwkSourceShort(uint16_t sourceShort) {
  if (sourceShort == 0x0000U || sourceShort == g_parentShort ||
      sourceShort == g_network.coordinatorShort) {
    return true;
  }

