lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/examples/Zigbee/ZigbeeHaOnOffLightJoinable/ZigbeeHaOnOffLightJoinable.ino
  return g_parentShort == 0U && g_network.coordinatorShort == 0U;
}

bool isCoordinatorNwkSource(uint16_t sourceShort) {
  return sourceShort == 0x0000U ||
         (g_network.coordinatorShort != 0U &&
          sourceShort == g_network.coordinatorShort);
}

bool acceptInboundNwkSecurityCounter(uint16_t sourceShort, uint64_t sourceIeee,
                                     uint32_t frameCounter) {
  if (frameCounter == 0U ||
      (g_lastInboundSecurityFrameCounter != 0U &&
       frameCounter <= g_lastInboundSecurityFrameCounter)) {
    return false;
  }

  uint8_t emptySlot = kInboundNwkSecurityCounterSlots;
  uint8_t replaceSlot = 0U;
  uint32_t oldestCounter = 0xFFFFFFFFUL;
  for (uint8_t i = 0U; i < kInboundNwkSecurityCounterSlots; ++i) {
    InboundNwkSecurityCounter& entry = g_inboundNwkSecurityCounters[i];
    if (!entry.used) {
      if (emptySlot == kInboundNwkSecurityCounterSlots) {
        emptySlot = i;
      }
      continue;
    }

    const bool sameIeee =
        sourceIeee != 0U && entry.sourceIeee != 0U &&
        sourceIeee == entry.sourceIeee;
    const bool sameShort =
        sourceIeee == 0U && entry.sourceIeee == 0U &&
        sourceShort == entry.sourceShort;
    if (sameIeee || sameShort) {
      if (frameCounter <= entry.frameCounter) {
        return false;
      }
      entry.sourceShort = sourceShort;
      entry.sourceIeee = sourceIeee;
      entry.frameCounter = frameCounter;
      return true;
    }

    if (entry.frameCounter < oldestCounter) {
      oldestCounter = entry.frameCounter;
      replaceSlot = i;
    }
  }

  InboundNwkSecurityCounter& entry =
      g_inboundNwkSecurityCounters[(emptySlot != kInboundNwkSecurityCounterSlots)
                                       ? emptySlot
                                       : replaceSlot];
  entry.used = true;
  entry.sourceShort = sourceShort;
  entry.sourceIeee = sourceIeee;
  entry.frameCounter = frameCounter;
  return true;
}

bool sendNwkCommand(uint16_t destinationShort, const uint8_t* payload,
                    uint8_t payloadLength) {
  if (!g_joined || payload == nullptr || payloadLength == 0U) {
    return false;
  }
  const bool useSecurity = g_securityEnabled && g_haveActiveNetworkKey;

  ZigbeeNetworkFrame nwk{};
  nwk.frameType = ZigbeeNwkFrameType::kCommand;
  nwk.securityEnabled = useSecurity;
  nwk.destinationShort = destinationShort;
  nwk.sourceShort = g_localShort;
  nwk.radius = 30U;
  nwk.sequence = g_nwkSequence++;

  uint8_t nwkFrame[127] = {0U};
  uint8_t nwkLength = 0U;
  if (useSecurity) {
    ZigbeeNwkSecurityHeader security{};
    security.valid = true;
    security.securityControl = kZigbeeSecurityControlNwkEncMic32;
    if (!g_outgoingFrameCounters.allocate(
            ZigbeeOutgoingCounterDomain::kNwk, &g_store,
            &security.frameCounter)) {
      return false;
    }
    security.sourceIeee = kIeeeAddress;
    security.keySequence = g_activeNetworkKeySequence;
    if (!ZigbeeSecurity::buildSecuredNwkFrame(nwk, security, g_activeNetworkKey,
                                              payload, payloadLength, nwkFrame,
                                              &nwkLength)) {
      return false;
    }
  } else if (!ZigbeeCodec::buildNwkFrame(nwk, payload, payloadLength, nwkFrame,
                                         &nwkLength)) {
    return false;
  }

  uint8_t psdu[127] = {0U};
  uint8_t psduLength = 0U;
  if (!ZigbeeRadio::buildDataFrameShort(g_macSequence++, g_panId,
                                        destinationShort, g_localShort, nwkFrame,
                                        nwkLength, psdu, &psduLength, false)) {
    return false;
  }

  return g_radio.transmit(psdu, psduLength, false, 1200000UL);
}

bool sendApsFrameExtendedWithCounter(
    uint16_t destinationShort, uint8_t deliveryMode,
    uint16_t destinationGroup, uint8_t destinationEndpoint,
    uint16_t clusterId, uint16_t profileId, uint8_t sourceEndpoint,
    const uint8_t* payload, uint8_t payloadLength, uint8_t apsCounterValue,
    bool trackAck) {
  if (!g_joined) {
    return false;
  }
  const bool useSecurity = g_securityEnabled && g_haveActiveNetworkKey;

  ZigbeeApsDataFrame aps{};
  aps.frameType = ZigbeeApsFrameType::kData;
  aps.deliveryMode = deliveryMode;
  aps.ackRequested = trackAck && (deliveryMode == kZigbeeApsDeliveryUnicast);
  aps.destinationEndpoint = destinationEndpoint;
  aps.destinationGroup = destinationGroup;
  aps.clusterId = clusterId;
  aps.profileId = profileId;
  aps.sourceEndpoint = sourceEndpoint;
  aps.counter = apsCounterValue;

  uint8_t apsFrame[127] = {0U};
  uint8_t apsLength = 0U;
  if (!ZigbeeCodec::buildApsDataFrame(aps, payload, payloadLength, apsFrame,
                                      &apsLength)) {
    return false;
  }

  ZigbeeNetworkFrame nwk{};
  nwk.frameType = ZigbeeNwkFrameType::kData;
  nwk.securityEnabled = useSecurity;
  nwk.destinationShort = destinationShort;
  nwk.sourceShort = g_localShort;
  nwk.radius = 30U;
  nwk.sequence = g_nwkSequence++;

  uint8_t nwkFrame[127] = {0U};
  uint8_t nwkLength = 0U;
  if (useSecurity) {
    ZigbeeNwkSecurityHeader security{};
    security.valid = true;
    security.securityControl = kZigbeeSecurityControlNwkEncMic32;
    if (!g_outgoingFrameCounters.allocate(
            ZigbeeOutgoingCounterDomain::kNwk, &g_store,
            &security.frameCounter)) {
      return false;
    }
    security.sourceIeee = kIeeeAddress;
    security.keySequence = g_activeNetworkKeySequence;
    if (!ZigbeeSecurity::buildSecuredNwkFrame(nwk, security, g_activeNetworkKey,
                                              apsFrame, apsLength, nwkFrame,
                                              &nwkLength)) {
      return false;
    }
  } else if (!ZigbeeCodec::buildNwkFrame(nwk, apsFrame, apsLength, nwkFrame,
                                         &nwkLength)) {
    return false;
  }

  uint8_t psdu[127] = {0U};
  uint8_t psduLength = 0U;
  if (!ZigbeeRadio::buildDataFrameShort(g_macSequence++, g_panId,
                                        destinationShort, g_localShort, nwkFrame,
                                        nwkLength, psdu, &psduLength, false)) {
    return false;
  }

