lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/examples/Zigbee/ZigbeeHaOnOffLightJoinable/ZigbeeHaOnOffLightJoinable.ino
  const bool sent = g_radio.transmit(psdu, psduLength, false, 1200000UL);
  if (sent && trackAck && aps.deliveryMode == kZigbeeApsDeliveryUnicast) {
    rememberPendingApsAck(destinationShort, aps, payload, payloadLength);
  }
  return sent;
}

bool sendApsFrameWithCounter(uint16_t destinationShort,
                             uint8_t destinationEndpoint, uint16_t clusterId,
                             uint16_t profileId, uint8_t sourceEndpoint,
                             const uint8_t* payload, uint8_t payloadLength,
                             uint8_t apsCounterValue, bool trackAck) {
  return sendApsFrameExtendedWithCounter(
      destinationShort, kZigbeeApsDeliveryUnicast, 0U, destinationEndpoint,
      clusterId, profileId, sourceEndpoint, payload, payloadLength,
      apsCounterValue, trackAck);
}

bool resendPendingApsFrame(uint8_t slot) {
  if (slot >= kPendingApsAckSlots || !g_pendingApsAcks[slot].active) {
    return false;
  }
  PendingApsAck& pending = g_pendingApsAcks[slot];
  const bool sent = sendApsFrameWithCounter(
      pending.destinationShort, pending.destinationEndpoint,
      pending.clusterId, pending.profileId, pending.sourceEndpoint,
      pending.payload, pending.payloadLength, pending.counter, false);
  if (sent) {
    pending.deadlineMs = millis() + kApsAckTimeoutMs;
  }
  return sent;
}

void maybeExpirePendingApsAck(uint32_t nowMs) {
  for (uint8_t i = 0U; i < kPendingApsAckSlots; ++i) {
    PendingApsAck& pending = g_pendingApsAcks[i];
    if (!pending.active ||
        static_cast<int32_t>(nowMs - pending.deadlineMs) < 0) {
      continue;
    }
    if (pending.retriesRemaining > 0U) {
      --pending.retriesRemaining;
      const bool resent = resendPendingApsFrame(i);
      Serial.print("aps_ack retry ctr=0x");
      Serial.print(pending.counter, HEX);
      Serial.print(" cluster=0x");
      Serial.print(pending.clusterId, HEX);
      Serial.print(" remaining=");
      Serial.print(pending.retriesRemaining);
      Serial.print(" sent=");
      Serial.print(resent ? "yes" : "no");
      Serial.print("\r\n");
      if (resent) {
        continue;
      }
    }

    Serial.print("aps_ack miss ctr=0x");
    Serial.print(pending.counter, HEX);
    Serial.print(" cluster=0x");
    Serial.print(pending.clusterId, HEX);
    Serial.print("\r\n");
    clearPendingApsAckSlot(i);
  }
}

bool sendApsAcknowledgement(uint16_t destinationShort,
                            const ZigbeeApsDataFrame& request) {
  if (!g_joined || request.deliveryMode != kZigbeeApsDeliveryUnicast ||
      !request.ackRequested) {
    return false;
  }
  const bool useSecurity = g_securityEnabled && g_haveActiveNetworkKey;

  uint8_t apsFrame[127] = {0U};
  uint8_t apsLength = 0U;
  if (!ZigbeeCodec::buildApsDataAcknowledgement(request, apsFrame,
                                                &apsLength)) {
    return false;
  }

  ZigbeeNetworkFrame nwk{};
  nwk.frameType = ZigbeeNwkFrameType::kData;
  nwk.securityEnabled = useSecurity;
  nwk.destinationShort = destinationShort;
  nwk.sourceShort = g_localShort;
  nwk.radius = 30U;
  nwk.sequence = g_nwkSequence++;

  uint8_t nwkFrame[127] = {0U};
  uint8_t nwkLength = 0U;
  if (useSecurity) {
    ZigbeeNwkSecurityHeader security{};
    security.valid = true;
    security.securityControl = kZigbeeSecurityControlNwkEncMic32;
    if (!g_outgoingFrameCounters.allocate(
            ZigbeeOutgoingCounterDomain::kNwk, &g_store,
            &security.frameCounter)) {
      return false;
    }
    security.sourceIeee = kIeeeAddress;
    security.keySequence = g_activeNetworkKeySequence;
    if (!ZigbeeSecurity::buildSecuredNwkFrame(nwk, security, g_activeNetworkKey,
                                              apsFrame, apsLength, nwkFrame,
                                              &nwkLength)) {
      return false;
    }
  } else if (!ZigbeeCodec::buildNwkFrame(nwk, apsFrame, apsLength, nwkFrame,
                                         &nwkLength)) {
    return false;
  }

  uint8_t psdu[127] = {0U};
  uint8_t psduLength = 0U;
  if (!ZigbeeRadio::buildDataFrameShort(g_macSequence++, g_panId,
                                        destinationShort, g_localShort, nwkFrame,
                                        nwkLength, psdu, &psduLength, false)) {
    return false;
  }

  return g_radio.transmit(psdu, psduLength, false, 1200000UL);
}

bool sendApsFrame(uint16_t destinationShort, uint8_t destinationEndpoint,
                  uint16_t clusterId, uint16_t profileId,
                  uint8_t sourceEndpoint, const uint8_t* payload,
                  uint8_t payloadLength) {
  return sendApsFrameWithCounter(destinationShort, destinationEndpoint,
                                 clusterId, profileId, sourceEndpoint, payload,
                                 payloadLength, g_apsCounter++, false);
}

bool sendGroupApsFrame(uint16_t destinationShort, uint16_t destinationGroup,
                       uint16_t clusterId, uint16_t profileId,
                       uint8_t sourceEndpoint, const uint8_t* payload,
                       uint8_t payloadLength) {
  return sendApsFrameExtendedWithCounter(
      destinationShort, kZigbeeApsDeliveryGroup, destinationGroup, 0U,
      clusterId, profileId, sourceEndpoint, payload, payloadLength,
      g_apsCounter++, false);
}

bool sendEndDeviceTimeoutRequest() {
  refreshCommissioningState();
  if (!ZigbeeCommissioning::shouldRequestEndDeviceTimeout(g_network)) {
    return false;
  }
  ZigbeeCommissioning::recordEndDeviceTimeoutRequest(&g_network, millis());

  uint8_t command[8] = {0U};
  uint8_t commandLength = 0U;
  if (!ZigbeeCodec::buildNwkEndDeviceTimeoutRequestCommand(
          g_network.endDeviceTimeoutIndex, g_network.endDeviceConfiguration,
          command, &commandLength)) {
    return false;
  }

  return sendNwkCommand(g_parentShort, command, commandLength);
}

bool sendDeviceAnnounce() {
  ZigbeeCommissioning::recordDeviceAnnounceAttempt(&g_network, millis());
  uint8_t payload[127] = {0U};
  uint8_t payloadLength = 0U;
  if (!g_device.buildDeviceAnnounce(g_zdoSequence++, payload, &payloadLength)) {
    return false;
  }
  const bool sent = sendApsFrame(g_parentShort, 0U, kZigbeeZdoDeviceAnnounce,
                                 kZigbeeProfileZdo, 0U, payload,
                                 payloadLength);
  if (sent) {
    ZigbeeCommissioning::completeDeviceAnnounce(&g_network);
  }
  return sent;
}

bool sendAttributeReport(uint16_t clusterId) {
  uint8_t zclFrame[127] = {0U};
  uint8_t zclLength = 0U;
  if (!g_device.buildAttributeReport(clusterId, g_zclSequence++, zclFrame,
                                     &zclLength) ||
      zclLength == 0U) {
    return false;
  }

  ZigbeeResolvedBindingDestination destination{};
  if (g_device.resolveBindingDestination(kLocalEndpoint, clusterId,
                                         &destination)) {
    if (destination.addressMode == ZigbeeBindingAddressMode::kGroup &&
        destination.groupId != 0U) {
      return sendGroupApsFrame(
          g_parentShort, destination.groupId, clusterId,
          kZigbeeProfileHomeAutomation, kLocalEndpoint, zclFrame, zclLength);
    }
    if (destination.addressMode == ZigbeeBindingAddressMode::kExtended &&
        destination.endpoint != 0U) {
      return sendApsFrame(g_parentShort, destination.endpoint, clusterId,
                          kZigbeeProfileHomeAutomation, kLocalEndpoint,
                          zclFrame, zclLength);
    }
  }
  return sendApsFrame(g_parentShort, kCoordinatorEndpoint, clusterId,
                      kZigbeeProfileHomeAutomation, kLocalEndpoint, zclFrame,
                      zclLength);
}

