lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/examples/Zigbee/ZigbeeHaOnOffLightJoinable/ZigbeeHaOnOffLightJoinable.ino
  if (action == ZigbeeCommissioningAction::kRequestEndDeviceTimeout) {
    const bool ok = sendEndDeviceTimeoutRequest();
    Serial.print("end_device_timeout_req ");
    Serial.print(ok ? "OK" : "FAIL");
    Serial.print("\r\n");
    if (ok) {
      listenForDirectTraffic(
          static_cast<uint32_t>(NRF54L15_CLEAN_ZIGBEE_POST_COMMAND_LISTEN_US));
      pollCoordinator();
    }
  } else if (action == ZigbeeCommissioningAction::kSendDeviceAnnounce) {
    const bool ok = sendDeviceAnnounce();
    Serial.print("device_announce ");
    Serial.print(ok ? "OK" : "FAIL");
    Serial.print("\r\n");
  }

  if ((now - g_lastPollMs) >= effectivePollIntervalMs) {
    g_lastPollMs = now;
    pollCoordinator();
  }
  maybeReceiveDirectInterviewTraffic(now);
  maybeExpirePendingApsAck(now);
  maybeSendScheduledReports(now);
  applyLedState();

  if ((now - g_lastStatusMs) >= 5000U) {
    g_lastStatusMs = now;
    Serial.print("alive ch=");
    Serial.print(g_channel);
    Serial.print(" pan=0x");
    Serial.print(g_panId, HEX);
    Serial.print(" short=0x");
    Serial.print(g_localShort, HEX);
    Serial.print(" parent=0x");
    Serial.print(g_parentShort, HEX);
    Serial.print(" coord=0x");
    Serial.print(g_network.coordinatorShort, HEX);
    Serial.print(" nwk_seq=");
    Serial.print(g_haveActiveNetworkKey ? g_activeNetworkKeySequence : 0U);
    Serial.print(" poll_ms=");
    Serial.print(g_parentPollIntervalMs);
    Serial.print(" onoff=");
    Serial.print(g_device.onOff() ? "ON" : "OFF");
    Serial.print("\r\n");
  }

  delay(1);
}

namespace {

void printEnergyDetectSweep() {
  Serial.print("ed_scan");
  for (uint8_t channel = 11U; channel <= 26U; ++channel) {
    uint8_t ed = 0U;
    if (!g_radio.setChannel(channel) || !g_radio.sampleEnergyDetect(&ed)) {
      Serial.print(" ch");
      Serial.print(channel);
      Serial.print("=?");
      continue;
    }
    Serial.print(" ch");
    Serial.print(channel);
    Serial.print('=');
    Serial.print(ed);
  }
  Serial.print("\r\n");
  g_radio.setChannel(g_channel);
}

}  // namespace
